[
	{
		"id": "f1",
		"title": "Cofre de techo CUPRA",
		"description": "Aumenta tu capacidad de carga con el elegante cofre de techo, perfectamente integrado con el diseño de tu CUPRA Tavascan.",
		"image": "https://placehold.co/800x600.png",
		"category": "Accesorios",
		"isFeatured": true,
		"details": "El cofre de techo CUPRA ofrece un espacio adicional de 400 litros, ideal para viajes largos. Su diseño aerodinámico reduce la resistencia al viento y el consumo de energía. Incluye cierre centralizado y apertura dual para fácil acceso."
	},
	{
		"id": "f2",
		"title": "Cockpit moderno y espacioso",
		"description": "Disfruta de un interior premium con un diseño vanguardista que combina espacio y tecnología en tu CUPRA Tavascan.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//CUPRA%20TAVASCAN%20096.webp",
		"category": "Interior",
		"isFeatured": true,
		"details": "El cockpit del CUPRA Tavascan ofrece una experiencia inmersiva con materiales de alta calidad y acabados deportivos. Su diseño ergonómico maximiza el espacio interior mientras mantiene todos los controles al alcance del conductor. Incluye iluminación ambiental personalizable y almacenamiento inteligente."
	},
	{
		"id": "f3",
		"title": "Techo panorámico CUPRA",
		"description": "Disfruta de una experiencia única con el techo panorámico transparente que inunda de luz natural el interior de tu CUPRA Tavascan.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//CUPRA%20TAVASCAN%20031.webp",
		"category": "Interior",
		"isFeatured": true,
		"details": "El techo panorámico CUPRA ofrece una superficie acristalada de más de 1.4 metros cuadrados con filtro solar UV. Incluye cortina eléctrica para regular la entrada de luz y sistema de apertura parcial para ventilación. Su cristal laminado de alta resistencia proporciona aislamiento acústico y térmico superior."
	},
	{
		"id": "f4",
		"title": "Sistema de infoentretenimiento de 15\"",
		"description": "Disfruta de una experiencia digital inmersiva con la pantalla de 15 pulgadas con alta resolución y respuesta táctil precisa.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//CUPRA%20TAVASCAN%20099.webp",
		"category": "Tecnología",
		"isFeatured": false,
		"details": "La pantalla flotante de 15 pulgadas con resolución 4K proporciona una experiencia visual excepcional. El sistema es compatible con Apple CarPlay y Android Auto inalámbricos, y cuenta con actualización automática de mapas y navegación predictiva."
	},
	{
		"id": "f5",
		"title": "Carga rápida de 135 kW",
		"description": "Recarga la batería de tu CUPRA Tavascan del 10% al 80% en solo 30 minutos gracias a su tecnología de carga ultrarrápida.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//cupra-tavascan-vz-trim-t.webp",
		"category": "Rendimiento",
		"isFeatured": false,
		"details": "El sistema de carga rápida de 135 kW permite recargar hasta 100 km de autonomía en solo 7 minutos. Compatible con la mayoría de las redes de carga rápida europeas, incluye planificador de rutas inteligente que optimiza las paradas de carga."
	},
	{
		"id": "f6",
		"title": "Head-up Display con Realidad Aumentada",
		"description": "Visualiza información esencial directamente en tu campo de visión sin apartar la vista de la carretera.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//CUPRA%20TAVASCAN%20100.webp",
		"category": "Tecnología",
		"isFeatured": false,
		"details": "El sistema Head-up Display con realidad aumentada proyecta información crítica como velocidad, navegación e indicaciones de seguridad directamente sobre el parabrisas. Las flechas de navegación se superponen sobre la carretera real para una orientación intuitiva."
	},
	{
		"id": "f7",
		"title": "Asientos deportivos CUPRA",
		"description": "Experimenta el máximo confort y sujeción con los asientos deportivos ergonómicos con acabados premium.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//CAR_SEAT.webp",
		"category": "Interior",
		"isFeatured": true,
		"details": "Los asientos deportivos CUPRA combinan confort y soporte lateral para una conducción dinámica. Fabricados con materiales sostenibles y microfibra Dinamica®, incluyen función de masaje y memoria de posición con hasta 3 perfiles diferentes."
	},
	{
		"id": "f8",
		"title": "Faros Matrix LED",
		"description": "Sistema de iluminación avanzado con control adaptativo",
		"fullDescription": "Los faros Matrix LED proporcionan una iluminación superior sin deslumbrar a otros conductores. La tecnología adaptativa ajusta automáticamente el haz de luz según las condiciones de la carretera, otros vehículos y peatones, ofreciendo máxima visibilidad en todo momento.",
		"image": "https://xlelknonfenpcsdiyglf.supabase.co/storage/v1/object/public/images//LED.webp",
		"category": "Iluminación",
		"specs": [
			{ "name": "Potencia", "value": "150W" },
			{ "name": "Alcance", "value": "500m" },
			{ "name": "Control", "value": "Automático" }
		],
		"isFeatured": true
	}
]
